package com.esports.response;

/**
 * 2XX （请求成功）表示成功处理了请求的状态代码。<br/>
 * 3XX （请求错误）表示要完成请求，需要进一步操作。 通常，这些状态代码用来重定向。<br/>
 * 4XX （请求错误）这些状态代码表示请求可能出错，妨碍了服务器的处理。<br/>
 * 5XX （请求错误）这些状态代码表示服务器在尝试处理请求时发生内部错误。 这些错误可能是服务器本身的错误，而不是请求出错。<br/>
 */
public enum ResultCode {

    _200(200, "请求成功"),
    _300(300, "账号格式错误(6-12位包含字母和数字组成，但不能为纯数字"),
    _301(301, "密码必须由字母和数字组成,且长度要在6-12位之间"),
    _302(302, "原始密码错误"),
    _303(303, "连续登录错误超过5次，今日登录受限"),
    _304(304, "调整会员资料正在审核中,请不要重复提交申请"),
    _305(305, "当前应用无新版本发布"),
    _400(400, "请求错误"),
    _401(401, "认证失败,请重新登录"),
    _402(402, "账号或者密码错误"),
    _403(403, "用户被锁定"),
    _405(405, "验证码错误或者已过期"),
    _406(406, "提现功能暂不可用"),
    _407(407, "域名访问限制"),
    _408(408, "认证令牌无效"),
    _409(409, "账号已经存在"),
    _410(410, "银行卡已经存在"),
    _411(411, "提交参数格式有误"),
    _412(412, "账户余额不足"),
    _413(413, "未绑定银行卡"),
    _414(414, "本次提现金额超过规定范围"),
    _415(415, "本次提现已超额或今日提现次数已用完"),
    _416(416, "两次提交密码不一致"),
    _417(417, "手机和账号不匹配"),
    _418(418, "未绑定手机号"),
    _419(419, "订单已经失效"),
    _420(420, "验证码发送过于频繁"),
    _421(421, "今日抢单次数已用完"),
    _422(422, "当前手机号今日内发送验证码数量已超出限制"),
    _430(430, "手机号已经被使用"),
    _431(431, "手机号未注册"),
    _432(432, "历史订单未处理"),
    _433(433, "邀请码无效"),
    _434(434, "充值金额不符合渠道设置标准"),
    _435(435, "未设置交易密码"),
    _436(436, "当前订单状态无法进行此操作"),
    _437(437, "交易密码错误"),
    _438(438, "QQ号已被占用"),
    _439(439, "微信号已被占用"),
    _440(440, "邮箱号已被占用"),
    _441(441, "无法获取上传文件/图片对象"),
    _442(442, "该会员不是您的下线,无法进行当前操作"),
    _443(443, "非代理身份,可加入合营计划或者联系管理员"),
    _444(444, "代理资料审核中,请不要重复操作"),
    _445(445, "该登录账号已被使用"),
    _446(446, "银行卡数量超过限制3张"),
    _447(447, "旧交易密码错误"),
    _448(448, "账号不存在"),
    _449(449, "理财金额不能低于100元"),
    _450(450, "可结算洗码金额不能低于1元"),
    _451(451, "引导链接长度不能超过255"),
    _452(452, "今日存款申请次数已超出限制"),
    _453(453, "未支付或支付失败订单过多，请稍候重试"),
    _454(454, "密码修改页面已失效，请返回重试"),
    _455(455, "不允许再次修改个人资料，如需修改请联系客服"),
    _500(500, "服务错误"),
    _501(501, "服务器繁忙,请稍后重试"),
    _502(502, "接口访问失效"),
    _503(503, "接口签名错误"),
    _504(504, "游戏平台正在维护中"),
    _505(505, "您的页面请求中有违反安全规则元素存在，拒绝访问"),
    _506(506, "访问过于频繁，请您稍后重试");

    /**
     * 状态码
     */
    public int code;

    /**
     * 提示信息
     */
    public String message;

    ResultCode(int code, String message) {
        this.code = code;
        this.message = message;
    }

    public int getCode() {
        return code;
    }

    /**
     * @return the message
     */
    public String getMessage() {
        return message;
    }

    /**
     * @param message the message to set
     */
    public void setMessage(String message) {
        this.message = message;
    }

    /**
     * @param code the code to set
     */
    public void setCode(int code) {
        this.code = code;
    }

}
